#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web-Dev/runs/run-FcB5sbxCnHRaMEZi

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E2WK19VXEQOQCH]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=3228599042]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E36U11KHAWUB2P]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe-dev.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/106.8390d3bf.chunk.js.map"]: Refreshing state... [id=static/js/106.8390d3bf.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/719.a25f1e9e.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/719.a25f1e9e.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/942.4ed9a84c.chunk.js"]: Refreshing state... [id=static/js/942.4ed9a84c.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/main.dce9ee63.css.map"]: Refreshing state... [id=static/css/main.dce9ee63.css.map]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js.map"]: Refreshing state... [id=static/js/924.16f99540.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/719.a25f1e9e.chunk.js.map"]: Refreshing state... [id=static/js/719.a25f1e9e.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js"]: Refreshing state... [id=static/js/924.16f99540.chunk.js]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/942.b7abd170.chunk.css"]: Refreshing state... [id=static/css/942.b7abd170.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/777.107dea8d.chunk.js"]: Refreshing state... [id=static/js/777.107dea8d.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/css/main.dce9ee63.css"]: Refreshing state... [id=static/css/main.dce9ee63.css]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js.map"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/719.a25f1e9e.chunk.js"]: Refreshing state... [id=static/js/719.a25f1e9e.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/777.107dea8d.chunk.js.map"]: Refreshing state... [id=static/js/777.107dea8d.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.38d7289f.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.38d7289f.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/942.4ed9a84c.chunk.js.map"]: Refreshing state... [id=static/js/942.4ed9a84c.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/js/main.38d7289f.js.map"]: Refreshing state... [id=static/js/main.38d7289f.js.map]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js.map"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/942.b7abd170.chunk.css.map"]: Refreshing state... [id=static/css/942.b7abd170.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/main.38d7289f.js"]: Refreshing state... [id=static/js/main.38d7289f.js]
module.web.aws_s3_object.upload_webapp["static/js/106.8390d3bf.chunk.js"]: Refreshing state... [id=static/js/106.8390d3bf.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.38d7289f.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.38d7289f.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.38d7289f.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/942.4ed9a84c.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/942.b7abd170.chunk.css"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/942.b7abd170.chunk.css.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/942.4ed9a84c.chunk.js"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "08ec9ee8cecbb93111f4176fc75b5b61" -> "cb92a66780e7eb3969f70f00cf865e01"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "n6DL3T4Rv_o.2H2cHspfPN4pX_D1B1md" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "8059451fdc5e696d41810bdc47e25f4c" -> "19618bd7d8265233c800edab44f865e0"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "pLX8mIAelgUP9wz9.XjrMyEKjb6ogzdn" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.38d7289f.js"] will be destroyed
  # (because key ["static/js/main.38d7289f.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "c36d1095e6600cf6d48baef1bb3ac785" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.38d7289f.js" -> null
      - key                    = "static/js/main.38d7289f.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.38d7289f.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "JQb9xlSVrLtqii05_8Ns_2F48p780PeN" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.38d7289f.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.38d7289f.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "ad1529f76e3e9c44d0f3385f7571ad68" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.38d7289f.js.LICENSE.txt" -> null
      - key                    = "static/js/main.38d7289f.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.38d7289f.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "sCvFw1E02RYrfLq.CTNOqzgzmjyMzQeU" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.38d7289f.js.map"] will be destroyed
  # (because key ["static/js/main.38d7289f.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "a6b83e5f0ec375b01aa429e8b580c912" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.38d7289f.js.map" -> null
      - key                    = "static/js/main.38d7289f.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.38d7289f.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "9nj4zqqEizvHyza8OkcW7AywmXczTdVs" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.5110adc1.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "74a06ba2625f52c4448a316d6538f419"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.5110adc1.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.5110adc1.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.5110adc1.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "ad1529f76e3e9c44d0f3385f7571ad68"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.5110adc1.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.5110adc1.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.5110adc1.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "093451fc14a4ac05d8f6c09474bdc003"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.5110adc1.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.5110adc1.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 37 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @dependabot[bot], Action: `pull_request`*